# ── Taps ─────────────────────────────────────────────────────────────────────
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "nikolaeu/numi"

# ── Shell & terminal ──────────────────────────────────────────────────────────
brew "bash"                    # cross-platform fallback shell
brew "bash-completion@2"
brew "stow"                    # dotfiles management
brew "tmux"                    # terminal multiplexer
brew "fzf"                     # fuzzy finder
brew "bat"                     # better cat
brew "fd"                      # better find
brew "ripgrep"                 # better grep
brew "tree"                    # directory tree
brew "yq"                      # yaml processor
brew "yamllint"

# ── Git ───────────────────────────────────────────────────────────────────────
brew "git"
brew "gh"                      # GitHub CLI
brew "lazygit"                 # git TUI

# ── Editors ───────────────────────────────────────────────────────────────────
brew "neovim"                  # LazyVim — available, deferred (Linux primary)
brew "luarocks"                # neovim lua dependency
cask "zed"

# ── Node ──────────────────────────────────────────────────────────────────────
brew "fnm"                     # node version manager

# ── Go ────────────────────────────────────────────────────────────────────────
brew "go"
brew "golang-migrate"
brew "go-delve/delve/dlv"                # go debugger

# ── DevOps & infra ────────────────────────────────────────────────────────────
brew "ansible"
brew "helm"
brew "k3d"
brew "kubernetes-cli"
brew "podman"
brew "awscli"
cask "docker-desktop"

# ── Misc dev tools ────────────────────────────────────────────────────────────
brew "deno"
brew "livekit"
brew "nmap"
brew "imagemagick"
cask "db-browser-for-sqlite"
cask "git-credential-manager"

# ── CLI utilities ─────────────────────────────────────────────────────────────
brew "foreman"
brew "neo4j-mcp"
brew "bitwarden-cli"
brew "nikolaeu/numi/numi-cli"

# ── Terminal ──────────────────────────────────────────────────────────────────
cask "alacritty"

# ── Window management ─────────────────────────────────────────────────────────
cask "nikitabobko/tap/aerospace"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ── Apps ──────────────────────────────────────────────────────────────────────
cask "bitwarden"
cask "obsidian"
cask "espanso"                 # text expander
cask "ukelele"                 # keyboard layout tool
cask "microsoft-edge"          # work browser
cask "gimp"
cask "rawtherapee"

# ── Removed (dead weight) ─────────────────────────────────────────────────────
# nvm        — replaced by fnm
# n          — replaced by fnm
# warp       — second terminal, using Alacritty
# emacs-app  — unused
# zed@preview — prefer stable
# tpm        — tmux plugin manager, no plugins in use yet
# arc        — second browser, using Safari as primary
# vagrant    — unused
